# GetUseWllClsrByStyle

## Description
Gets whether the use wall closure setting of a symbol definition, plug-in object style, or plug-in object is by style.

```pascal
FUNCTION GetUseWllClsrByStyle(hObject : HANDLE): BOOLEAN;
```

```python
def vs.GetUseWllClsrByStyle(hObject):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|The symbol definition, plug-in object style, or plug-in object.|

## See Also
VS Functions:
SetUseWllClsrByStyle

## Version
Availability: from Vectorworks 2022

## Category
* Objects - Custom